glcloud/keil_v5/ARM/PACK/.Web/NXP.LPC802_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>LPC802_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for LPC802</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.1">Removed invalid entries from Software Content Register</release>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="LPC802" Dvendor="NXP:11">
      <debugconfig default="swd" clock="5000000" swj="0"/>
      <sequences>
        <sequence name="ResetProcessor" disable="true"/>
        <sequence name="ForceCoreHalt">
          <block>
      __var SCS_Addr   = 0xE000E000;
      __var AIRCR_Addr = SCS_Addr + 0xD0C;
      __var DHCSR_Addr = SCS_Addr + 0xDF0;
      __var DCRSR_Addr = SCS_Addr + 0xDF4;
      __var DCRDR_Addr = SCS_Addr + 0xDF8;
      __var DHCSR_Val  = 0;
    </block>
          <control while="((DHCSR_Val = Read32(DHCSR_Addr)) &amp; 0x00020000) == 0" timeout="100000"/>
          <control if="(DHCSR_Val &amp; 0x00020000) == 0">
            <block info="Halt core">
        Write32(DHCSR_Addr,0xA05F0003);                                  // halt core
      </block>
            <control while="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0" timeout="1000"/>
          </control>
        </sequence>
        <sequence name="ResetSystem" info="SYSRESETREQ">
          <block>
      __var SCS_Addr   = 0xE000E000;
      __var AIRCR_Addr = SCS_Addr + 0xD0C;
      __var DHCSR_Addr = SCS_Addr + 0xDF0;

      __errorcontrol = 1;                                              // ignore errors
      Write32(AIRCR_Addr, 0x05FA0004);                                 // Execute SYSRESETREQ via AIRCR
      __errorcontrol = 0;                                              // check errors

      DAP_Delay(1000);                                                 // time for reset
    </block>
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="100000"/>
          <block>
      Sequence("ForceCoreHalt");                                       // halt the core
    </block>
        </sequence>
        <sequence name="ResetProcessor" info="VECTRESET">
          <block>
      __var SCS_Addr   = 0xE000E000;
      __var AIRCR_Addr = SCS_Addr + 0xD0C;
      __var DHCSR_Addr = SCS_Addr + 0xDF0;

      __errorcontrol = 1;                                              // ignore errors
      Write32(AIRCR_Addr, 0x05FA0001);                                 // Execute VECTRESET via AIRCR
      __errorcontrol = 0;                                              // check errors
    </block>
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="100000"/>
          <block>
      Sequence("ForceCoreHalt");                                       // halt the core
    </block>
        </sequence>
        <sequence name="ResetHardware" info="HW RESET">
          <block>
      __var nReset      = 0x80;
      __var canReadPins = 0;

      canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);     // Deassert nRESET line
    </block>
          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000"/>
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
          </control>
          <control if="!canReadPins">
            <block>
        DAP_SWJ_Pins(nReset, nReset, 0);                               // Assert nRESET line
      </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000"/>
          </control>
          <block>
      Sequence("ForceCoreHalt");                                       // halt the core
    </block>
        </sequence>
        <sequence name="ResetCatchSet">
          <block>
      __var SCS_Addr   = 0xE000E000;
      __var DHCSR_Addr = SCS_Addr + 0xDF0;
      __var DEMCR_Addr = SCS_Addr + 0xDFC;
      __var value      = 0;
      __var FPB_BKPT_H = 0x80000000;
      __var FPB_BKPT_L = 0x40000000;
      __var FPB_COMP_M = 0x1FFFFFFC;
      __var FPB_KEY    = 0x00000002;
      __var FPB_ENABLE = 0x00000001;
    </block>
          <!-- read reset vector from Flash -->
          <block>
      value = Read32(DEMCR_Addr);
      Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR
    </block>
          <!-- set BreakPoint regardless whether reset vector is valid or not -->
          <block>
      Write32(0x40048000, 0x00000002);                                 // Map Flash to Vectors
      value = Read32 (0x00000004);                                     // Read Reset Vector

      value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
      Write32(0xE0002008, value);                                      // Set BP0 to Reset Vector
      Write32(0xE0002000, (FPB_KEY | FPB_ENABLE));                     // Enable FPB
    </block>
          <block>
      Read32(DHCSR_Addr);                                              // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
    </block>
        </sequence>
        <sequence name="ResetCatchClear">
          <block>
      __var SCS_Addr   = 0xE000E000;
      __var DEMCR_Addr = SCS_Addr + 0xDFC;
      __var value      = 0;

