glcloud/keil_v5/ARM/PACK/.Web/NXP.LPC802_DFP.pdsc
      value = Read32(DEMCR_Addr);
      Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR

      Write32(0xE0002008, 0x00000000);                                 // Clear BP0
      Write32(0xE0002000, 0x00000002);                                 // Disable FPB
    </block>
        </sequence>
      </sequences>
      <description>The LPC802 are an ARM Cortex-M0+ based, low-cost 32-bit MCU family operating at CPU frequencies of up to 15 MHz. The LPC802 support up to 16 KB of flash memory and2 KB of SRAM.The peripheral complement of the LPC802 includes one I2C-bus interface, up to two USARTs, one SPI interface, one multi-rate timer, self-wake-up timer, one general purpose 32-bit counter/timer, one 12-bit ADC, one analog comparator, function-configurable I/O ports through a switch matrix, and up to 17 general-purpose I/O pins.</description>
      <device Dname="LPC802">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="30000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/LPC802_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x4000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x10000000" size="0x0800" access="rw" default="1"/>
        <algorithm name="arm/LPC80x_16.FLM" start="0x00000000" size="0x00004000" RAMstart="0x10000000" RAMsize="0x00000800" default="1"/>
        <debug svd="LPC802.xml"/>
        <variant Dvariant="LPC802M011JDH20">
          <compile header="fsl_device_registers.h" define="CPU_LPC802M011JDH20"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC802M011JDH20/LPC802_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="LPC802M001JDH16">
          <compile header="fsl_device_registers.h" define="CPU_LPC802M001JDH16"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC802M001JDH16/LPC802_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="LPC802M001JDH20">
          <compile header="fsl_device_registers.h" define="CPU_LPC802M001JDH20"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC802M001JDH20/LPC802_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="LPC802M001JHI33">
          <compile header="fsl_device_registers.h" define="CPU_LPC802M001JHI33"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC802M001JHI33/LPC802_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.LPC802_AND_driver.lpc_miniusart">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.LPC802">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.LPC802_AND_utility.debug_console_lite">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="device.LPC802_AND_driver.common">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC802_AND_driver.common_AND_driver.swm_connections">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="swm_connections"/>
    </condition>
    <condition id="device.LPC802_AND_driver.common_AND_driver.syscon_connections">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="syscon_connections"/>
    </condition>
    <condition id="device.LPC802_AND_driver.common_AND_driver.power_no_lib">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
    </condition>
    <condition id="device.LPC802_AND_device.LPC802_CMSIS_AND_driver.clock_AND_driver.reset">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="LPC802_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
    </condition>
    <condition id="device.LPC802_AND_component.miniusart_adapter_AND_device.LPC802_startup_AND_driver.clock_AND_driver.common_AND_driver.lpc_gpio_AND_driver.lpc_iocon_lite_AND_driver.lpc_miniusart_AND_driver.power_no_lib_AND_driver.rom_api_AND_driver.swm_AND_utility.debug_console_lite">
      <accept Dname="LPC802*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="miniusart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require Cclass="Device" Cgroup="Startup" Csub="LPC802_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rom_api"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="swm"/>
    </condition>
